In [1]:
import pandas as pd

In [24]:
data = {'year': [
        2010, 2011, 2012,
        2010, 2011, 2012,
        2010, 2011, 2012
    ],
        'team': [
            'FCBarcelona', 'FCBarcelona', 'FCBarcelona',
            'RMadrid', 'RMadrid', 'RMadrid',
            'ValenciaCF', 'ValenciaCF', 'ValenciaCF'
        ],
        'wins': [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws': [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]
       }
df = pd.DataFrame(data=data, columns=['year', 'team', 'wins', 'draws', 'losses'])
df

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

In [3]:
#Array NumPy:

import numpy as np
#https://docs.scipy.org/doc/numpy-1.15.1/reference/generated/numpy.random.RandomState.html#numpy.random.RandomState
np.random.seed(5) # atribui um int como semente do RNG (random number generator)
# cria array aleatório 10x3 com inteiros entre 0 e 9
data = np.random.randint(0,10,size=(10,3))
cols = list('ABC') #cria lista = [‘A’, ‘B’, ‘C’]
print(cols)
df = pd.DataFrame(data=data, columns=cols)
df

['A', 'B', 'C']

   A  B  C
0  3  6  6
1  0  9  8
2  4  7  0
3  0  7  1
4  5  7  0
5  1  4  6
6  2  9  9
7  9  9  1
8  2  7  0
9  5  0  0

In [5]:
type(df.shape)

tuple

In [6]:
l, c = df.shape
print('DataFrame com ' + str(l) + ' linhas e ' + str(c) + ' colunas')

DataFrame com 10 linhas e 3 colunas

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int32
 1   B       10 non-null     int32
 2   C       10 non-null     int32
dtypes: int32(3)
memory usage: 248.0 bytes

In [7]:
df.describe()

               A          B          C
count  10.000000  10.000000  10.000000
mean    3.100000   6.500000   3.100000
std     2.766867   2.758824   3.695342
min     0.000000   0.000000   0.000000
25%     1.250000   6.250000   0.000000
50%     2.500000   7.000000   1.000000
75%     4.750000   8.500000   6.000000
max     9.000000   9.000000   9.000000

In [8]:
df.head()

   A  B  C
0  3  6  6
1  0  9  8
2  4  7  0
3  0  7  1
4  5  7  0

In [9]:
df.tail()

   A  B  C
5  1  4  6
6  2  9  9
7  9  9  1
8  2  7  0
9  5  0  0

In [10]:
df.dtypes

A    int32
B    int32
C    int32
dtype: object

In [11]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [15]:
df.axes

[RangeIndex(start=0, stop=10, step=1), Index(['A', 'B', 'C'], dtype='object')]

In [16]:
df.columns[0]

'A'

In [17]:
df.axes[0]

RangeIndex(start=0, stop=10, step=1)

In [12]:
df.size

30

In [13]:
df.count()

A    10
B    10
C    10
dtype: int64

In [14]:
df.empty

False

In [15]:
df.ndim

2

In [17]:
dfs = df['A']
print(type(dfs))
print(dfs.ndim)

<class 'pandas.core.series.Series'>
1

In [20]:
x= df.head(1) # unica linha
x

   A  B  C
0  3  6  6

In [68]:
df.tail(1)

   year        team  wins  draws  losses
8  2012  ValenciaCF    19      8      11

In [24]:
s1 = pd.Series({'a': 1, 'b': 2, 'c': 3})
s1

a    1
b    2
c    3
dtype: int64

In [25]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

In [26]:
s1.ndim

1

In [27]:
s1.count()

3

In [28]:
df.count()

A    10
B    10
C    10
dtype: int64

In [21]:
dft = pd.DataFrame({ "A": np.random.rand(3), 
                     "B": 1,
                     "C": "foo",
                     "D": pd.Timestamp("20010102"),
                     "E": pd.Series([1.0] * 3).astype("float32"),
                     "F": False,
                     "G": pd.Series([1] * 3, dtype="int8")
                   }) 
dft

          A  B    C          D    E      F  G
0  0.144164  1  foo 2001-01-02  1.0  False  1
1  0.165613  1  foo 2001-01-02  1.0  False  1
2  0.963931  1  foo 2001-01-02  1.0  False  1

In [22]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

In [82]:
# datas passadas como string dd-mm-aaaa
raw_data = {'nome': ['Pedro', 'Joaquim', 
                     'Marcos', 'Mateus'], 
            'age': [20, 19, 22, 21], 
            'cor_favorita': ['azul', 'amarelo',  
                               'cinza', 'verde'], 
            'nota_final': [8.8, 9.2, 9.5, 7.0], 
            'data_nasc': ['01-02-2000', '08-05-1997', 
                           '04-28-1996', '12-16-1995']}
raw_data

{'nome': ['Pedro', 'Joaquim', 'Marcos', 'Mateus'],
 'age': [20, 19, 22, 21],
 'cor_favorita': ['azul', 'amarelo', 'cinza', 'verde'],
 'nota_final': [8.8, 9.2, 9.5, 7.0],
 'data_nasc': ['01-02-2000', '08-05-1997', '04-28-1996', '12-16-1995']}

In [83]:
# cria o dataframe passando os nomes como índices de cada linha
df = pd.DataFrame(raw_data,  
                  index = ['Pedro', 'Joaquim',  
                           'Marcos', 'Mateus']) 
df

            nome  age cor_favorita  nota_final   data_nasc
Pedro      Pedro   20         azul         8.8  01-02-2000
Joaquim  Joaquim   19      amarelo         9.2  08-05-1997
Marcos    Marcos   22        cinza         9.5  04-28-1996
Mateus    Mateus   21        verde         7.0  12-16-1995

In [84]:
# Cria coluna ano, usando o DatetimeIndex
df['ano'] = pd.DatetimeIndex(df['data_nasc']).year 
  
# Cria a coluna mes, usando o DatetimeIndex
df['mes'] = pd.DatetimeIndex(df['data_nasc']).month 
  
df

            nome  age cor_favorita  nota_final   data_nasc   ano  mes
Pedro      Pedro   20         azul         8.8  01-02-2000  2000    1
Joaquim  Joaquim   19      amarelo         9.2  08-05-1997  1997    8
Marcos    Marcos   22        cinza         9.5  04-28-1996  1996    4
Mateus    Mateus   21        verde         7.0  12-16-1995  1995   12

In [55]:
df

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

In [56]:
df['wins']

0    30
1    28
2    32
3    29
4    32
5    26
6    21
7    17
8    19
Name: wins, dtype: int64

In [57]:
df.wins

0    30
1    28
2    32
3    29
4    32
5    26
6    21
7    17
8    19
Name: wins, dtype: int64

In [58]:
df.loc[:,'wins']

0    30
1    28
2    32
3    29
4    32
5    26
6    21
7    17
8    19
Name: wins, dtype: int64

In [61]:
df.loc[:, ['wins', 'losses']]

   wins  losses
0    30       2
1    28       3
2    32       2
3    29       4
4    32       2
5    26       5
6    21       9
7    17      11
8    19      11

In [63]:
df.loc[:, 'wins':'losses']

   wins  draws  losses
0    30      6       2
1    28      7       3
2    32      4       2
3    29      5       4
4    32      4       2
5    26      7       5
6    21      8       9
7    17     10      11
8    19      8      11

In [64]:
df[['wins','losses']]

   wins  losses
0    30       2
1    28       3
2    32       2
3    29       4
4    32       2
5    26       5
6    21       9
7    17      11
8    19      11

In [71]:
df[['wins', 'draws']].median(axis=0)

wins     28.0
draws     7.0
dtype: float64

In [72]:
df[['wins', 'draws']].median(axis=1)

0    18.0
1    17.5
2    18.0
3    17.0
4    18.0
5    16.5
6    14.5
7    13.5
8    13.5
dtype: float64

In [73]:
df

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

In [74]:
df.loc[1:3]

   year         team  wins  draws  losses
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4

In [77]:
df['draws'] = 0 # (altera toda a coluna draws)
df.loc[4,'wins'] = 35
df

        year         team  wins  draws  losses
0     2010.0  FCBarcelona  30.0      0     2.0
1     2011.0  FCBarcelona  28.0      0     3.0
2     2012.0  FCBarcelona  32.0      0     2.0
3     2010.0      RMadrid  29.0      0     4.0
4     2011.0      RMadrid  35.0      0     2.0
5     2012.0      RMadrid  26.0      0     5.0
6     2010.0   ValenciaCF  21.0      0     9.0
7     2011.0   ValenciaCF  17.0      0    11.0
8     2012.0   ValenciaCF  19.0      0    11.0
2011     NaN          NaN  35.0      0     NaN

In [78]:
df.dropna(inplace=True)

In [79]:
df

     year         team  wins  draws  losses
0  2010.0  FCBarcelona  30.0      0     2.0
1  2011.0  FCBarcelona  28.0      0     3.0
2  2012.0  FCBarcelona  32.0      0     2.0
3  2010.0      RMadrid  29.0      0     4.0
4  2011.0      RMadrid  35.0      0     2.0
5  2012.0      RMadrid  26.0      0     5.0
6  2010.0   ValenciaCF  21.0      0     9.0
7  2011.0   ValenciaCF  17.0      0    11.0
8  2012.0   ValenciaCF  19.0      0    11.0

In [26]:
df['year'].value_counts().head(3)

2010    3
2011    3
2012    3
Name: year, dtype: int64

Exemplo com Dataset fortune500, atualizado até 2018: https://fortune.com/fortune500/2020/search/. Obtendo o top 3 de receitas (Revenues)

In [34]:
dff = pd.read_csv('../datasets/fortune1000.csv')
dff.columns

Index(['rank', 'title', 'Previous Rank', 'Revenues ($M)', 'Revenue Change',
       'Profits ($M)', 'Profit Change', 'Assets ($M)',
       'Mkt Value as of 3/29/18 ($M)', 'Employees', 'CEO', 'CEO Title',
       'Sector', 'Industry', 'Years on Fortune 500 List', 'City', 'State',
       'Latitude', 'Longitude'],
      dtype='object')

In [41]:
dff[['title', 'Revenues ($M)']].head(3)

                title Revenues ($M)
0             Walmart     $500,343
1         Exxon Mobil     $244,363
2  Berkshire Hathaway     $242,137